micropython/micropython/ports/esp32/boards/SPARKFUN_THINGPLUS_ESP32C5/mpconfigboard.h
// Board specific definitions for the SparkFun Thing Plus ESP32-C5.

#define MICROPY_HW_BOARD_NAME               "SparkFun Thing Plus ESP32-C5"
#define MICROPY_HW_MCU_NAME                 "ESP32C5"

#define MICROPY_HW_I2C0_SCL            (24)
#define MICROPY_HW_I2C0_SDA            (23)

#define MICROPY_HW_SPI1_SCK  (10)
#define MICROPY_HW_SPI1_MOSI (8)
#define MICROPY_HW_SPI1_MISO (9)
